<a href="https://colab.research.google.com/github/water-beetle/Python_flearning/blob/master/%2312%20DataFrame_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B3%80%EA%B2%BD%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

#중복된 항 제거

In [0]:
df = pd.DataFrame({'k1' : ["one"] * 3 + ["two"] * 4,
                   'k2' : [1, 1, 2, 3, 3, 4, 4]})

In [4]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

*duplicated() - 중복된 항은 True, 중복이 아닌 항은 False*

In [5]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [6]:
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [0]:
df["v1"] = np.arange(7)

In [8]:
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [9]:
df.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [10]:
df.drop_duplicates(["k2"])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [11]:
df.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [0]:
df2 = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                   'ounces' : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [13]:
df2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
meat_to_animal = {'bacon' : 'pig', 'pulled pork' : 'pig', 'pastrami' : 'cow', 'corned beef' : 'cow', 'honey ham' : 'pig', 'nova lox' : 'salmon'}

In [15]:
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

*apply - 2차원의 행별, 영별에 함수 적용

In [0]:
 df2["animal"] = df2["food"].apply(lambda x: meat_to_animal[x.lower()])

In [19]:
df2

          food  ounces   anima  animal
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [0]:
  s = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [22]:
s

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

#Categories

* 카테고리 (category,범주형) 데이터를 관리하기 위해 Categories 자료형 사용 
 고객의 성별을 나타내는 열에서 '남성'이면 "male", '여성'이면 "female" 값을 가지는 것이 대표적인 경우*

In [0]:
df3 = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [26]:
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [0]:
df3["grade"] = df3["raw_grade"].astype("category")

In [29]:
df3["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [37]:
#카테고리값 확인
df3["grade"].cat.categories

Index(['a', 'b', 'e'], dtype='object')

In [0]:
df3["grade"].cat.categories = ["very good", "good", "bad"]

In [40]:
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e        bad

In [0]:
#카테고리 개수를 늘리거나 줄일 때 사용
df3["grade"] = df3["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [43]:
df3["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5          bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

*정의한 카테고리의 순서에 때라 대소관계를 가짐*

In [45]:
df3.sort_values(by = "grade")

   id raw_grade      grade
5   6         e        bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

**숫자데이터를 카테고리화**

In [0]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [0]:
# pd.cut()함수를 사용, ages리스트의 각 성분들을 카테고리화 bins는 범위 
cats = pd.cut(ages, bins)

In [50]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [52]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [56]:
# 값이 몇번째 카테로리에 포함되어 있는지 나타내는 코드
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [58]:
# 각 구간에 해당하는 카테고리 값의 개수 확인
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [0]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [60]:
#카테고리별로 이름 부여
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [0]:
data = np.random.rand(20)

In [62]:
data

array([0.9874394 , 0.13448323, 0.97178367, 0.0548952 , 0.86247935,
       0.33281417, 0.20532522, 0.23402647, 0.25282041, 0.91646012,
       0.34117528, 0.14045184, 0.31211763, 0.13449801, 0.91200933,
       0.90424578, 0.37332765, 0.12660086, 0.20154053, 0.61378425])

In [63]:
#카테고리를 동일한 범위의 4개 구간으로 나누고, precision=2(소수 2번째까지 고려)
pd.cut(data, 4, precision = 2)

[(0.75, 0.99], (0.054, 0.29], (0.75, 0.99], (0.054, 0.29], (0.75, 0.99], ..., (0.75, 0.99], (0.29, 0.52], (0.054, 0.29], (0.054, 0.29], (0.52, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.054, 0.29] < (0.29, 0.52] < (0.52, 0.75] < (0.75, 0.99]]

In [0]:
data2 = np.random.randn(1000)

In [0]:
# pd.qcut() 지정한 갯수만큼의 구간을 정하고 분위수를 구분값으로 한다.
cats = pd.qcut(data2, 4)

In [67]:
cats

[(-0.618, 0.00559], (-2.92, -0.618], (-2.92, -0.618], (0.00559, 0.705], (-0.618, 0.00559], ..., (-0.618, 0.00559], (0.705, 3.284], (-2.92, -0.618], (0.705, 3.284], (0.705, 3.284]]
Length: 1000
Categories (4, interval[float64]): [(-2.92, -0.618] < (-0.618, 0.00559] < (0.00559, 0.705] <
                                    (0.705, 3.284]]